/**
 **     Моделирование кинематики, динамики и механики взаимодействия
 **     множества поляризованных частиц первого и второго порядка
 **     (пространственные вихреисточники и диполи)
 **                                                             (c)2021 ‏יְרוּשָׁלַיִם
 **/
#include "Dipoles.h"                 // базовые структуры тензорной математики
static
const Real Vol=EqSphere*_Pi*4/3,     // объем частицы-шарика = 1,0        [м³]
           TimeDrop=24.0;            // количество шагов до столкновения частиц
//         g=9.8106,                 // ускорение свободного падения    [м/с²]
//         ro=1.29,                  // плотность воздуха              [кг/м³]
//         R_Earth=6367554.0;        // радиус Земли, сфероид Красовского  [м]
      Real TimeStep=1e-3,     // интервал времени для одного такта эксперимента
           ExtFlow=0.0;       // вечно встречный набегающий поток по абсциссе
//
//       функции скалярного и векторного воздействия одиночного диполя
//
//line Real one_2( _Real r ){ return r<1 ? sqrt(r)*(3.5-2.5*r) : 1/(r*r); }
//line Real one_2( _Real r ){ return r<1 ? 2-r*r : 1/(r*r); }     // 2^2
static Real one_3( Real r )
{ r=max( 1.0e-2,fabs( r ) );                   // на всякий случай боле 1.0е-6
  switch( ex.Edge )// 0-линейноость; 1-единичность; 2-удвоение; 3-ноль к центру
  { case 1: return r<1 ?       r : 1/( r*r*r );           // 3^3 сингулярность
    case 2: return r<1 ?       1 : 1/( r*r*r ); // pow( r,-3 )-pow( 1+r,-5 );
    case 3: return r<1 ? 2-r*r*r : 1/( r*r*r ); // 3^3
    case 4: return r<1 ? sqrt(r)*(4.5-3.5*r) : 1/(r*r*r); default: return 1;
} }
Vector dipole_v // вызванные скорости
    ( _Vector d, // дипольный радиус до первого критического узла встреч потока
      _Vector r ) // радиус-вектор удаленной точки к контрольному центру диполя
    { Real s=norm(r); return (r*(d%r)-r*(d*r)/2)*one_3( sqrt( s/norm(d) ) )/s;
    }
//! Главная процедура реализации одного такта вычислительного эксперимента.
//  В процедуре не предполагается возможностей для внешних прерываний.
//
bool One_Time_Step()
{
 Dipoles &Prev=Dipoles_array[Time_count%Dipole_route],
         &Next=Dipoles_array[(Time_count+1)%Dipole_route];
 const unsigned Q=nDip; // -=- пустое, но пусть будет для контроля неизменности
//
//  1.1) - корректировка вызванных скоростей для придания совместного разгона
//         и поступательного движения сразу для всех поляризованных корпускул
//
//if( ex.Flow && Q>1 )   // наложение свободного набегающего потока на скорости
  for( int i=0; i<Q; i++ ) // копируется предыдущий массив, переустанавливается
  { Next[i].R=Prev[i].R;   //(Vector){-ExtFlow}дипольный разгон внешнему потоку
    Next[i].V=0.0;
    Next[i].W=0.0;
    Next[i].M=1.0;
  }
  // 3.3 перерасчёт скорости и допустимого шага во времени пусть поначалу
  //     выполняется независимо, т.е. в отдельном поисковом цикле

 Real Rw=0.425,    // подгонка разгона под три диполя c учетом порчи гравитации
      dT=1.0;     // ... ограничение по максимуму расчётного интервала времени
//goto WW;       // обход выбора=поиска максимально допустимого шага во времени
#pragma omp parallel for shared( dT )
  for( int i=0; i<Q; i++ )
  for( int j=0; j<i; j++ ) // if( i!=j )     -- ExtFlow - прозапас устойчивости
  { Vector R=( Prev[i].R-Prev[j].R );                  // R не может обнуляться
//         W=( Prev[i].V-Prev[j].V )%dir( R );                 // всяко опасное
//  if( sqr( W )>1e-4 ){ T=abs( R )/sqr( W ); if( dT>T )dT=T; }    // ускорение
    Real W=abs( Prev[i].V )+abs( Prev[j].V ); // двойной абсолют: не запутаться
    if( W*W>eps ){ Real T=abs( R )/W; if( dT>T )dT=T; }
  } TimeStep=dT/TimeDrop;                        // про переназначение времени
WW: Next.T=Prev.T+TimeStep;                      // весьма жёстко, не забывать!
//  2)+ исходный поверочный вариант простого скалярного притяжения корпускул.
//      Постоянная притяжения (/_Pd/60) пока выбирается достаточно малой,
//      чтобы расталкивание шариков не проявлялось взрывным разлётом
//
//goto WG;
  if( ex.Grav )       //&& Time_count>0 goto A3; пусть пока закрыто - совсем...
  { Rw=0.21;          // reduction(+: V)
#pragma omp parallel for
    for( int i=0; i<Q; i++ )   //! суммарное притяжение от всего роя частиц
    { Vector V=Zero;           // скорости потока строго из Physical Simulation
      const Dipole &B=Prev[i]; // здесь есть наведенные скорости от всех частиц
      for( int k=0; k<Q; k++ )if( i!=k )
      { const Dipole &D=Prev[k];           // неизменный во времени старый слой
        Vector r=( D.R-B.R )*EqSphere;      // радиус-вектор между корпускулами
        Real ss=norm( r ),s=sqrt( ss );     // радиус соприкосновения частиц
                      r/=s;                 // нормированный вектор поверхности
        if( ex.Grav&1 )V-=r*(1/ss-1)/ss;    //! функция притяжения/отталкивания
        if( ex.Grav&2 )                     //! вариант соприкосновения шариков
        { if( s>1.4655712319 )V+=r/ss;      // при квадратичном притяжении
                        else  V-=r*(1-s);   // и линейно-упругое столкновение
        }                                   // V*=EqSphere;
      }                                     // = результат учёта смежных частиц
      if( ex.Grav==3 )V/=120.0;             // средне-гладко-шариковые слабости
      Next[i].V += V*TimeStep/_Pd; //*60);  -= Приращение скорости и единичное
      Next[i].R += Next[i].V*TimeStep;      // смещение в пространстве под
  } }                                       // действием взаимного притяжения
WG:
//
//  1) - деформация потока в локальном местоположении (в центре) корпускулы,
//  суммированием вызванных скоростей от всех окружающих поляризованных частиц.
//  Отсутствие влияния окружающей среды предполагает, что несмотря на быстрые
//  перемещения диполей в пространстве, их внешнее влияние - вызванные скорости
//  вычисляются исходя из статического местоположения в конкретных
//  пространственных координатах на данный момент времени (то есть, с удалением
//      влияние безусловно ослабевает, или как бы - «теория относительности»,
//      и опять же при условии, что взаимное действие мгновенно-быстрое).
//
//goto WWW;
  if( ex.Edge ) //&& Time_count>0 )  //! пространственное распределение потоков
  {//if( Q<2 )Next[0].W=ExtFlow; else // закривуленными дипольными линиями тока
#pragma omp parallel for
    for( int i=0; i<Q; i++ )           // расслоение к параллельным вычислениям
    { Dipole &D=Next[i],&B=Prev[i];
      Vector W={ExtFlow*Rw};           // *EqSphere/(Q+.06) подгонка 3 частицам
           D.W=W;                      // вычисляются все наведённые скорости в
      for( int k=0; k<Q; k++ )if(k!=i) // центре текущего местоположения диполя
      { const Dipole &C=Prev[k];       // вызванные скорости связаны с объемом
//      D.W+=dipole_v( C.M,C.R-D.R );  // EqSphere - частицы - кубика - изнутри
        D.W+=dipole_v( C.M*EqSphere,C.R-D.R ); // - частицы - кубика - изнутри
      }                                //+= скорость в центральной точке диполя
      D.M = -dir( D.W );               // подворот встреч потоку и ExtFlow
//    D.M = -dir( D.V+D.W );           // подворот диполя встреч потоку ExtFlow
      D.R +=( D.W+D.M-W )*TimeStep;    // кинематика - проще не бывает
//    D.R += D.W*TimeStep;             // кинематика - проще не бывает
//   const Real U=norm( D.V );         // ≈≈≈≈≈≈≈≈≈ терять длину здесь не стоит
//    if( U<eps ){ if( !U )D.V=eps; else D.V*=eps/sqrt( U ); } // ноль по оси х
    }
  }
#if 0
  // 3.1 В динамическом варианте дипольный момент будет включать величину
  //     рассогласования скорости частицы относительно встречного потока.
  // В кинематическом варианте дипольный момент будет нормирован (одинаков),
  //    тогда обретённая скорость частицы просто компенсирует разницу М=1,5∙Ω∙V
  //    Формально кинематика исполняется в единой-абсолютной системе координат
  //
  if( ex.Body ) //! условно тонкая настройка временно исключается
  {
#pragma omp parallel for
    for( int i=0; i<Q; i++ )
    { Dipole &D=Next[i];            // дипольный момент на новый отсчет времени
//           &B=Prev[i];            //    опорная поляризованная диполь-частица
#if 0
      Vector VM =( D.V+B.V )/2;     // средний ветер на старый парус или
       D.M = -dir( VM );            // подворот диполя встреч новому потоку
       D.R += (D.M+VM)*TimeStep/16; // траектория движения центра тяжести
//     D.V += D.M+VM;               // к дипольным возмущениям следующего шага
#else
//    Vector A=(B.V-D.V)/TimeStep;  // приращение внешней скорости - ускорение
//     A += ( B.M+D.V )/TimeStep;   // ускорение от рассогласования силы и тяги
//     A = A*TimeStep;              // ускорение с учетом присоединённой массы
       D.M = -dir( D.V+D.W );        // подворот диполя встреч потоку +=ExtFlow
//     D.M = -dir( (Vector){ExtFlow}+D.W ); // подворот диполя встречу ExtFlow
//     D.R += (D.W+D.M)*TimeStep/16;         // кинематика - проще не бывает
#endif
  } } else {
  // 3.2 В кинематическом варианте дипольный момент будет нормирован (одинаков)
  //    тогда обретённая скорость частицы просто компенсирует разницу М=1,5∙Ω∙V
  //    Формально кинематика исполняется в единой-абсолютной системе координат
  //
#pragma omp parallel for
    for( int i=0; i<Q; i++ )
    { Dipole &D=Next[i];               // x EqSphere - масса на ускорение
      D.M = dir( D.V-D.W );               // подворот диполя встреч потоку
//    D.R += (D.M+D.V)*TimeStep/6;     // если скорость от нормы наперекосяк
//    D.R += D.V*TimeStep/6;           // или ~~ дрейф по ветровому сносу ~~
    }
  }
WWW:
goto WR;                             // исключение общего смещения !!
#pragma omp parallel for
  for( int i=0; i<Q; i++ )           // новое местоположение не сильно ожидаемо
  { Dipole &D=Next[i]; D.R += ( D.W+D.V+D.M )*TimeStep;
  }
WR:
#endif
  // + (Vector){ sin(k*.02),sin(k*.02),sin(k*.01) }         идём-едем, загуляли
  //           * sin(k*.04)*.005;                         гармонические шатания
  //                                          слежение за временем эксперимента
  ++Time_count;                         // прибавка счетчика в последний момент
  Next.Average();                       // Prev.T+TimeStep );
  return VideoStage();                  //!  с запросом приостановки вычислений
}
// Подведение итогов с попутным расчетом центра масс всей динамической системы
//            и осреднением всех динамических величин
//
Dipoles& Dipoles::Average()
{ Mean.M=Mean.V=Mean.W=Mean.R=0; // дипольный момент, скорость и местоположение
  for( int i=0; i<nDip; i++ )   // расчёт центра масс всей динамической системы
           Mean.R+=D[i].R,
           Mean.V+=D[i].V,
           Mean.W+=D[i].W,
           Mean.M+=D[i].M;
  if( nDip>1 )Mean.R/=nDip,Mean.M/=nDip,Mean.W/=nDip,Mean.V/=nDip;
         else Mean.V=-ExtFlow; return *this;
}
